Return-Path: <linux-i2c+bounces-9200-lists+linux-i2c=lfdr.de@vger.kernel.org>
X-Original-To: lists+linux-i2c@lfdr.de
Delivered-To: lists+linux-i2c@lfdr.de
Received: from sy.mirrors.kernel.org (sy.mirrors.kernel.org [147.75.48.161])
	by mail.lfdr.de (Postfix) with ESMTPS id 53709A1C71C
	for <lists+linux-i2c@lfdr.de>; Sun, 26 Jan 2025 09:57:07 +0100 (CET)
Received: from smtp.subspace.kernel.org (relay.kernel.org [52.25.139.140])
	(using TLSv1.2 with cipher ECDHE-ECDSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by sy.mirrors.kernel.org (Postfix) with ESMTPS id 7436A7A38A1
	for <lists+linux-i2c@lfdr.de>; Sun, 26 Jan 2025 08:56:57 +0000 (UTC)
Received: from localhost.localdomain (localhost.localdomain [127.0.0.1])
	by smtp.subspace.kernel.org (Postfix) with ESMTP id 9ADC81547E2;
	Sun, 26 Jan 2025 08:56:54 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org;
	dkim=pass (2048-bit key) header.d=wanadoo.fr header.i=@wanadoo.fr header.b="OxKZ+ef7"
X-Original-To: linux-i2c@vger.kernel.org
Received: from out.smtpout.orange.fr (out-16.smtpout.orange.fr [193.252.22.16])
	(using TLSv1.2 with cipher ECDHE-RSA-AES128-GCM-SHA256 (128/128 bits))
	(No client certificate requested)
	by smtp.subspace.kernel.org (Postfix) with ESMTPS id 25D5170805;
	Sun, 26 Jan 2025 08:56:49 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org; arc=none smtp.client-ip=193.252.22.16
ARC-Seal:i=1; a=rsa-sha256; d=subspace.kernel.org; s=arc-20240116;

> +#define NCT6694_CAN_EVT_RX_DATA_LOST	BIT(5)	/* Read-clear */
> +#define NCT6694_CAN_EVT_RX_DATA_IN	BIT(7)	/* Read-clear*/
> +
> +/* Command 10h - CAN Deliver */
> +#define NCT6694_CAN_DELIVER		0x10
> +#define NCT6694_CAN_DELIVER_SEL(buf_cnt)	\
> +	((buf_cnt) & 0xFF)
> +
> +/* Command 11h - CAN Receive */
> +#define NCT6694_CAN_RECEIVE		0x11
> +#define NCT6694_CAN_RECEIVE_SEL(idx, buf_cnt)	\
> +	((idx ? 0x80 : 0x00) | ((buf_cnt) & 0x7F))
> +
> +#define NCT6694_CAN_FRAME_TAG_CAN0	0xC0
> +#define NCT6694_CAN_FRAME_TAG_CAN1	0xC1
> +#define NCT6694_CAN_FRAME_FLAG_EFF	BIT(0)
> +#define NCT6694_CAN_FRAME_FLAG_RTR	BIT(1)
> +#define NCT6694_CAN_FRAME_FLAG_FD	BIT(2)
> +#define NCT6694_CAN_FRAME_FLAG_BRS	BIT(3)
> +#define NCT6694_CAN_FRAME_FLAG_ERR	BIT(4)
> +
> +#define NCT6694_NAPI_WEIGHT		32
> +
> +enum nct6694_event_err {
> +	NCT6694_CAN_EVT_ERR_NO_ERROR = 0,
> +	NCT6694_CAN_EVT_ERR_CRC_ERROR,
> +	NCT6694_CAN_EVT_ERR_STUFF_ERROR,
> +	NCT6694_CAN_EVT_ERR_ACK_ERROR,
> +	NCT6694_CAN_EVT_ERR_FORM_ERROR,
> +	NCT6694_CAN_EVT_ERR_BIT_ERROR,
> +	NCT6694_CAN_EVT_ERR_TIMEOUT_ERROR,
> +	NCT6694_CAN_EVT_ERR_UNKNOWN_ERROR,
> +};
> +
> +enum nct6694_event_status {
> +	NCT6694_CAN_EVT_STS_ERROR_ACTIVE = 0,
> +	NCT6694_CAN_EVT_STS_ERROR_PASSIVE,
> +	NCT6694_CAN_EVT_STS_BUS_OFF,
> +	NCT6694_CAN_EVT_STS_WARNING,
> +};
> +
> +struct __packed nct6694_can_setting {
> +	__le32 nbr;
> +	__le32 dbr;
> +	u8 active;
> +	u8 reserved[3];
> +	__le16 ctrl1;
> +	__le16 ctrl2;
> +	__le32 nbtp;
> +	__le32 dbtp;
> +};
> +
> +struct __packed nct6694_can_information {
> +	u8 tx_fifo_cnt;
> +	u8 rx_fifo_cnt;
> +	u8 reserved[2];
> +	__le32 can_clk;
> +};
> +
> +struct __packed nct6694_can_event {
> +	u8 err;
> +	u8 status;
> +	u8 tx_evt;
> +	u8 rx_evt;
> +	u8 rec;
> +	u8 tec;
> +	u8 reserved[2];
> +};
> +
> +struct __packed nct6694_can_frame {
> +	u8 tag;
> +	u8 flag;
> +	u8 reserved;
> +	u8 length;
> +	__le32 id;
> +	u8 data[CANFD_MAX_DLEN];
> +};
> +
> +struct nct6694_can_priv {
> +	struct can_priv can;	/* must be the first member */
> +	struct can_rx_offload offload;
> +	struct can_berr_counter bec;
> +	struct net_device *ndev;
> +	struct nct6694 *nct6694;
> +	struct workqueue_struct *wq;
> +	struct work_struct tx_work;
> +	struct nct6694_can_frame tx;
> +	struct nct6694_can_frame rx;
> +	struct nct6694_can_event event[2];
> +	unsigned char can_idx;
> +};

Move the bec to the end just before the can_idx, like this:

  struct nct6694_can_priv {
  	struct can_priv can;	/* must be the first member */
  	struct can_rx_offload offload;
  	struct net_device *ndev;
  	struct nct6694 *nct6694;
  	struct workqueue_struct *wq;
  	struct work_struct tx_work;
  	struct nct6694_can_frame tx;
  	struct nct6694_can_frame rx;
  	struct nct6694_can_event event[2];
  	struct can_berr_counter bec;
  	unsigned char can_idx;
  };

For what it is worth, it will save you eight bytes.

Before:

  $ pahole -C nct6694_can_priv drivers/net/can/usb/nct6694_canfd.o
  struct nct6694_can_priv {
  	struct can_priv            can;                  /*     0   368 */

  	/* XXX last struct has 1 hole */

  	/* --- cacheline 5 boundary (320 bytes) was 48 bytes ago --- */
  	struct can_rx_offload      offload __attribute__((__aligned__(8)));
/*   368   520 */

  	/* XXX last struct has 7 bytes of padding, 1 hole */

  	/* --- cacheline 13 boundary (832 bytes) was 56 bytes ago --- */
  	struct can_berr_counter    bec;                  /*   888     4 */

  	/* XXX 4 bytes hole, try to pack */

  	/* --- cacheline 14 boundary (896 bytes) --- */
  	struct net_device *        ndev;                 /*   896     8 */
  	struct nct6694 *           nct6694;              /*   904     8 */
  	struct workqueue_struct *  wq;                   /*   912     8 */
  	struct work_struct         tx_work;              /*   920    32 */
  	struct nct6694_can_frame   tx;                   /*   952    72 */
  	/* --- cacheline 16 boundary (1024 bytes) --- */
  	struct nct6694_can_frame   rx;                   /*  1024    72 */
  	/* --- cacheline 17 boundary (1088 bytes) was 8 bytes ago --- */
  	struct nct6694_can_event   event[2];             /*  1096    16 */
  	unsigned char              can_idx;              /*  1112     1 */

  	/* size: 1120, cachelines: 18, members: 11 */
  	/* sum members: 1109, holes: 1, sum holes: 4 */
  	/* padding: 7 */
  	/* member types with holes: 2, total: 2 */
  	/* paddings: 1, sum paddings: 7 */
  	/* forced alignments: 1 */
  	/* last cacheline: 32 bytes */
  } __attribute__((__aligned__(8)));


After:

  $ pahole -C nct6694_can_priv drivers/net/can/usb/nct6694_canfd.o
  struct nct6694_can_priv {
  	struct can_priv            can;                  /*     0   368 */

  	/* XXX last struct has 1 hole */

  	/* --- cacheline 5 boundary (320 bytes) was 48 bytes ago --- */
  	struct can_rx_offload      offload __attribute__((__aligned__(8)));
/*   368   520 */

  	/* XXX last struct has 7 bytes of padding, 1 hole */

  	/* --- cacheline 13 boundary (832 bytes) was 56 bytes ago --- */
  	struct net_device *        ndev;                 /*   888     8 */
  	/* --- cacheline 14 boundary (896 bytes) --- */
  	struct nct6694 *           nct6694;              /*   896     8 */
  	struct workqueue_struct *  wq;                   /*   904     8 */
  	struct work_struct         tx_work;              /*   912    32 */
  	struct nct6694_can_frame   tx;                   /*   944    72 */
  	/* --- cacheline 15 boundary (960 bytes) was 56 bytes ago --- */
  	struct nct6694_can_frame   rx;                   /*  1016    72 */
  	/* --- cacheline 17 boundary (1088 bytes) --- */
  	struct nct6694_can_event   event[2];             /*  1088    16 */
  	struct can_berr_counter    bec;                  /*  1104     4 */
  	unsigned char              can_idx;              /*  1108     1 */

  	/* size: 1112, cachelines: 18, members: 11 */
  	/* padding: 3 */
  	/* member types with holes: 2, total: 2 */
  	/* paddings: 1, sum paddings: 7 */
  	/* forced alignments: 1 */
  	/* last cacheline: 24 bytes */
  } __attribute__((__aligned__(8)));

> +static inline struct nct6694_can_priv *rx_offload_to_priv(struct can_rx_offload *offload)
> +{
> +	return container_of(offload, struct nct6694_can_priv, offload);
> +}
> +
> +static const struct can_bittiming_const nct6694_can_bittiming_nominal_const = {
> +	.name = DRVNAME,
> +	.tseg1_min = 2,
> +	.tseg1_max = 256,
> +	.tseg2_min = 2,
> +	.tseg2_max = 128,
> +	.sjw_max = 128,
> +	.brp_min = 1,
> +	.brp_max = 511,
> +	.brp_inc = 1,
> +};
> +
> +static const struct can_bittiming_const nct6694_can_bittiming_data_const = {
> +	.name = DRVNAME,
> +	.tseg1_min = 1,
> +	.tseg1_max = 32,
> +	.tseg2_min = 1,
> +	.tseg2_max = 16,
> +	.sjw_max = 16,
> +	.brp_min = 1,
> +	.brp_max = 31,
> +	.brp_inc = 1,
